package problem672

func flipLights(n int, presses int) int {
	if presses == 0 {
		return 1
	}

	if n == 1 {
		// 0 所有取反
		// 1 偶数位取反
		return 2
	}

	if n == 2 {
		// 00 所有取反
		// 10 偶数位取反
		// 01 奇数位取反
		// 01 1,4,7,10... 取反
		if presses == 1 {
			return 3
		}

		return 4
	}

	if n >= 3 {
		// 偶数位取反、奇数位取反 周期是2
		// 1,4,7,10... 取反 周期是3
		// 2*3=6 灯泡的最小重复周期是6

		// 123 456
		// 000 000 所有取反
		// 101 010 偶数位取反
		// 010 101 奇数位取反
		// 011 011 1,4,7,10... 取反

		// 将6个灯泡分为3个一组
		// 发现组一的每个状态，组二都有一个与之对应
		// 123 456
		// 000 000 所有取反
		// 101 010 偶数位取反
		// 010 101 奇数位取反
		// 011 011 1,4,7,10... 取反

		// 特别的
		// 101 010 偶数位取反
		// 010 101 奇数位取反
		// 组一的每个状态 组二都有一个与之对应 且每个位置上的值相反
		// 所以最多只需要考虑3个灯泡的状态
		if presses == 1 {
			return 4
		}

		if presses == 2 {
			return 7
		}

	}
	return 8
}
