package problem190

// 例子
// 12345678
// 87654321

// 向左,右 移动4位
// 56780000
// 00001234
// 56781234

// 使用掩码, 向左,右 移动2位
// 56001200
// 00560012
// ---------
// 00780034
// 78003400
// 78563412

// 使用掩码, 向左,右 移动1位
// 70503010
// 07050301
// --------
// 08060402
// 80604020
// 87654321
func reverseBits(num uint32) uint32 {
	// 向左,右 移动16位
	num = (num >> 16) | (num << 16)

	// 使用掩码, 向左,右 移动8位
	// 1111111100000000 0000000011111111
	num = ((num & 0xff00ff00) >> 8) | ((num & 0x00ff00ff) << 8)

	// 使用掩码, 向左,右 移动4位
	// 11110000 00001111
	num = ((num & 0xf0f0f0f0) >> 4) | ((num & 0x0f0f0f0f) << 4)

	// 使用掩码, 向左,右 移动2位
	// 11001100 00110011
	num = ((num & 0xcccccccc) >> 2) | ((num & 0x33333333) << 2)

	// 使用掩码, 向左,右 移动1位
	// 10101010 01010101
	num = ((num & 0xaaaaaaaa) >> 1) | ((num & 0x55555555) << 1)

	return num
}
